announcements/eww-updates-april-2014.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacspeak EWW Updates</title>
<!-- 2014-05-01 Thu 17:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacspeak EWW Updates</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacspeak EWW Updates</h2>
<div class="outline-text-2" id="text-1">
<p>
Within a few weeks, <a href="http://emacspeak.blogspot.com/2013/11/reading-web-content-efficiently.html">EWW</a> has become my prefered way of consuming
large amounts of Web content &#x2014; except for simple fill-out
forms, it has entirely replaced Emacs/W3 for me. Goes without
saying that I still use ChromeVox for Js-heavy Web sites.
</p>

<p>
This article summarizes  some of the major enhancements to EWW
implemented in module <span class="underline">emacspeak-eww</span>; See the online
documentation and key-binding help for complete details.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> EWW And Masquerade Mode</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You can now have EWW masquerade as modern  browsers; note that
some sites might serve you more feature-rich content in this
mode. 
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Smart Google Searches</h3>
<div class="outline-text-3" id="text-1-2">
<p>
All of the features from module <span class="underline">emacspeak-google</span> have been
integrated to work with EWW. In addition, if running in
masquerade-mode, you can quickly access knowledge cards if
available on the current results page.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Rich DOM  Filtering</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The suite of DOM filtered views has been enhanced to support
filtering by class, id, role, or element-list.  In addition, you
can also invert these filters.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Structure Navigation</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Emacspeak now supports structured navigation in pages rendered by
EWW, see the key-bindings for details.
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Integration With URL-Templates And Feeds</h3>
<div class="outline-text-3" id="text-1-5">
<p>
EWW is now fully integrated with Emacspeak WebSearch,
URL-Templates and Feeds. This means that hitting <span class="underline">g</span> in an EWW
buffer does the <i>right thing</i> with respect to updating the
rendered buffer:
</p>

<ul class="org-ul">
<li>If viewing a feed, the feed is reloaded before it is rendered
as HTML.
</li>
<li>If viewing a url-template, the template is re-opened,
prompting for user-input if needed.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> XSLT Integration</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Most of the functionality provided by module <span class="underline">emacspeak-xslt</span> for
filtering the DOM in the world of Emacs/W3 is achieved more
effectively via the DOM  filtering commands in <span class="underline">emacspeak-eww</span>
—that said, XSLT pre-processing is fully integrated with EWW via
supporting modules <span class="underline">emacspeak-ew</span> and <span class="underline">emacspeak-webutils</span>.
</p>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Other Fun Things To Do</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Here are some more fun things that might be worth doing:
</p>

<ul class="org-ul">
<li>Integrate <a href="http://phantomjs.org/">PhantomJS</a> with EWW  to load content that is
rendered via JS <span class="underline">document.write</span>.
</li>
<li>Integrate with  <a href="http://casperjs.org/./index.html">CasperJS</a> to enable interaction with
light-weight WebApps.
</li>
<li>Integrate with Chrome over the debugger API to access the
live DOM  within Chrome.
</li>
</ul>

<p>
<b>Share And Enjoy</b>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-05-01 Thu&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2014-05-01 Thu 17:24</p>
<p class="creator">Emacs 24.4.50.2 (Org mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
